# Pandas

#### -Pandas is used to analyze data.

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":["badhon","joy"],
    "city":["dhaka", "munshiganj"],
    "marks":[99,100]
}

In [3]:
dict1

{'name': ['badhon', 'joy'],
 'city': ['dhaka', 'munshiganj'],
 'marks': [99, 100]}

In [4]:
df= pd.DataFrame(dict1)  # Excel format

In [5]:
df

     name        city  marks
0  badhon       dhaka     99
1     joy  munshiganj    100

In [6]:
df.to_csv("name.csv")  # create csv file

In [7]:
df.to_csv("name_index_false.csv", index=False)  # without index

In [8]:
df.head(1)   # will show first 1 row

     name   city  marks
0  badhon  dhaka     99

In [9]:
df.tail(1)   # will show last 1 row

  name        city  marks
1  joy  munshiganj    100

In [10]:
df.describe()   # numerical columns statistical analysis

            marks
count    2.000000
mean    99.500000
std      0.707107
min     99.000000
25%     99.250000
50%     99.500000
75%     99.750000
max    100.000000

In [11]:
test= pd.read_csv("test.csv")   # Read CSV file

In [12]:
test

   Train no  Speed      City
0      3423     45     Dhaka
1      2342     37    Khulna
2     24234     98  Barishal
3       234     89    Sylhet
4       234     69     Dhaka

In [13]:
test["Speed"]   # Accessing individual column

0    45
1    37
2    98
3    89
4    69
Name: Speed, dtype: int64

In [14]:
test["Speed"][1] = 100  # updating value

C:\Users\ASUS\AppData\Local\Temp\ipykernel_15016\3749946446.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  test["Speed"][1] = 100  # updating value

In [15]:
test

   Train no  Speed      City
0      3423     45     Dhaka
1      2342    100    Khulna
2     24234     98  Barishal
3       234     89    Sylhet
4       234     69     Dhaka

In [16]:
test.index=['first','second','third','fourth','fifth']

In [17]:
test

        Train no  Speed      City
first       3423     45     Dhaka
second      2342    100    Khulna
third      24234     98  Barishal
fourth       234     89    Sylhet
fifth        234     69     Dhaka

In [18]:
# Series
ser = pd.Series(np.random.rand(34))   # 34 random

In [19]:
ser

0     0.075588
1     0.186559
2     0.411465
3     0.343045
4     0.202894
5     0.327623
6     0.241977
7     0.296250
8     0.694044
9     0.548162
10    0.370300
11    0.106053
12    0.183249
13    0.185158
14    0.865450
15    0.474566
16    0.507423
17    0.828517
18    0.009598
19    0.509672
20    0.024105
21    0.086775
22    0.230090
23    0.520447
24    0.148484
25    0.199361
26    0.142563
27    0.915777
28    0.846582
29    0.952199
30    0.843632
31    0.957961
32    0.654109
33    0.463465
dtype: float64

In [20]:
type(ser)

pandas.core.series.Series

In [21]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [22]:
newdf

            0         1         2         3         4
0    0.973056  0.963852  0.537418  0.572186  0.042026
1    0.330646  0.540555  0.737831  0.541328  0.469906
2    0.497565  0.741719  0.242204  0.019440  0.969605
3    0.969247  0.481050  0.413165  0.272260  0.950864
4    0.240078  0.062816  0.720590  0.204707  0.835847
..        ...       ...       ...       ...       ...
329  0.715793  0.668157  0.294528  0.190635  0.269703
330  0.586532  0.623190  0.696945  0.698055  0.050568
331  0.618469  0.147627  0.162156  0.932932  0.700429
332  0.814782  0.808982  0.443473  0.086186  0.062628
333  0.535169  0.700206  0.464598  0.104338  0.457526

[334 rows x 5 columns]

In [23]:
type(newdf)

pandas.core.frame.DataFrame

In [24]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.503297    0.515266    0.511179    0.512493    0.486233
std      0.268416    0.294636    0.290247    0.299683    0.295527
min      0.001323    0.000570    0.004872    0.000520    0.001818
25%      0.285557    0.262717    0.273937    0.256684    0.222904
50%      0.504224    0.549620    0.505594    0.541101    0.478389
75%      0.709336    0.770274    0.767608    0.763160    0.748869
max      0.996087    0.997091    0.998674    0.999974    0.996446

In [25]:
newdf[0][0] = "joy"

C:\Users\ASUS\AppData\Local\Temp\ipykernel_15016\125427934.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'joy' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "joy"

In [26]:
newdf.head(5)

          0         1         2         3         4
0       joy  0.963852  0.537418  0.572186  0.042026
1  0.330646  0.540555  0.737831  0.541328  0.469906
2  0.497565  0.741719  0.242204  0.019440  0.969605
3  0.969247  0.481050  0.413165  0.272260  0.950864
4  0.240078  0.062816  0.720590  0.204707  0.835847

In [27]:
type(newdf)

pandas.core.frame.DataFrame

In [28]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [29]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [30]:
newdf.to_numpy()  # convert to numpy array

array([['joy', 0.9638515685923459, 0.5374178278600704,
        0.5721855854815416, 0.04202600127859735],
       [0.33064580224344453, 0.5405548328752761, 0.7378313917374542,
        0.5413280715485707, 0.4699059737054533],
       [0.49756513512753275, 0.7417189717525554, 0.24220389855083857,
        0.019440225922374488, 0.9696049924971292],
       ...,
       [0.6184689941369497, 0.1476271213498398, 0.16215626554703377,
        0.9329316739534199, 0.7004291472211879],
       [0.8147820059874405, 0.808981855439655, 0.4434730151590396,
        0.086185877002936, 0.06262752931856663],
       [0.5351689019524464, 0.7002058974714053, 0.46459845336928307,
        0.10433843602214721, 0.4575260368744968]], dtype=object)

In [31]:
newdf[0][0]=0.4

In [32]:
newdf.to_numpy()

array([[0.4, 0.9638515685923459, 0.5374178278600704, 0.5721855854815416,
        0.04202600127859735],
       [0.33064580224344453, 0.5405548328752761, 0.7378313917374542,
        0.5413280715485707, 0.4699059737054533],
       [0.49756513512753275, 0.7417189717525554, 0.24220389855083857,
        0.019440225922374488, 0.9696049924971292],
       ...,
       [0.6184689941369497, 0.1476271213498398, 0.16215626554703377,
        0.9329316739534199, 0.7004291472211879],
       [0.8147820059874405, 0.808981855439655, 0.4434730151590396,
        0.086185877002936, 0.06262752931856663],
       [0.5351689019524464, 0.7002058974714053, 0.46459845336928307,
        0.10433843602214721, 0.4575260368744968]], dtype=object)

In [33]:
newdf.transpose()

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.4,0.330646,0.497565,0.969247,0.240078,0.288894,0.082081,0.500484,0.041564,0.384956,...,0.21437,0.040335,0.628898,0.219252,0.651535,0.715793,0.586532,0.618469,0.814782,0.535169
1,0.963852,0.540555,0.741719,0.48105,0.062816,0.806451,0.158097,0.770936,0.412951,0.686969,...,0.627065,0.404081,0.604857,0.624406,0.669752,0.668157,0.62319,0.147627,0.808982,0.700206
2,0.537418,0.737831,0.242204,0.413165,0.72059,0.748237,0.353406,0.400536,0.098968,0.381091,...,0.45576,0.878703,0.009648,0.280628,0.720486,0.294528,0.696945,0.162156,0.443473,0.464598
3,0.572186,0.541328,0.01944,0.27226,0.204707,0.801552,0.763564,0.586856,0.032539,0.450905,...,0.658527,0.505412,0.857216,0.407959,0.58392,0.190635,0.698055,0.932932,0.086186,0.104338
4,0.042026,0.469906,0.969605,0.950864,0.835847,0.629136,0.048813,0.699767,0.899393,0.684258,...,0.642393,0.041524,0.008728,0.160506,0.466677,0.269703,0.050568,0.700429,0.062628,0.457526

In [34]:
newdf.sort_index(axis=0, ascending= False)  # x axis index sort

            0         1         2         3         4
333  0.535169  0.700206  0.464598  0.104338  0.457526
332  0.814782  0.808982  0.443473  0.086186  0.062628
331  0.618469  0.147627  0.162156  0.932932  0.700429
330  0.586532  0.623190  0.696945  0.698055  0.050568
329  0.715793  0.668157  0.294528  0.190635  0.269703
..        ...       ...       ...       ...       ...
4    0.240078  0.062816  0.720590  0.204707  0.835847
3    0.969247  0.481050  0.413165  0.272260  0.950864
2    0.497565  0.741719  0.242204  0.019440  0.969605
1    0.330646  0.540555  0.737831  0.541328  0.469906
0         0.4  0.963852  0.537418  0.572186  0.042026

[334 rows x 5 columns]

In [35]:
newdf[0]

0           0.4
1      0.330646
2      0.497565
3      0.969247
4      0.240078
         ...
329    0.715793
330    0.586532
331    0.618469
332    0.814782
333    0.535169
Name: 0, Length: 334, dtype: object

In [36]:
newdf2=newdf.copy()  # copy

In [37]:
newdf2

            0         1         2         3         4
0         0.4  0.963852  0.537418  0.572186  0.042026
1    0.330646  0.540555  0.737831  0.541328  0.469906
2    0.497565  0.741719  0.242204  0.019440  0.969605
3    0.969247  0.481050  0.413165  0.272260  0.950864
4    0.240078  0.062816  0.720590  0.204707  0.835847
..        ...       ...       ...       ...       ...
329  0.715793  0.668157  0.294528  0.190635  0.269703
330  0.586532  0.623190  0.696945  0.698055  0.050568
331  0.618469  0.147627  0.162156  0.932932  0.700429
332  0.814782  0.808982  0.443473  0.086186  0.062628
333  0.535169  0.700206  0.464598  0.104338  0.457526

[334 rows x 5 columns]

In [38]:
newdf.loc[0,0] = 500

In [39]:
newdf.head(5)

          0         1         2         3         4
0       500  0.963852  0.537418  0.572186  0.042026
1  0.330646  0.540555  0.737831  0.541328  0.469906
2  0.497565  0.741719  0.242204  0.019440  0.969605
3  0.969247  0.481050  0.413165  0.272260  0.950864
4  0.240078  0.062816  0.720590  0.204707  0.835847

In [40]:
newdf.columns= list("ABCDE")   # column update

In [41]:
newdf.head(5)

          A         B         C         D         E
0       500  0.963852  0.537418  0.572186  0.042026
1  0.330646  0.540555  0.737831  0.541328  0.469906
2  0.497565  0.741719  0.242204  0.019440  0.969605
3  0.969247  0.481050  0.413165  0.272260  0.950864
4  0.240078  0.062816  0.720590  0.204707  0.835847

In [42]:
newdf.loc[0,"A"] = 1000

In [43]:
newdf.head(5)

          A         B         C         D         E
0      1000  0.963852  0.537418  0.572186  0.042026
1  0.330646  0.540555  0.737831  0.541328  0.469906
2  0.497565  0.741719  0.242204  0.019440  0.969605
3  0.969247  0.481050  0.413165  0.272260  0.950864
4  0.240078  0.062816  0.720590  0.204707  0.835847

In [44]:
newdf.loc[0,0] = 1000

In [45]:
newdf

            A         B         C         D         E       0
0        1000  0.963852  0.537418  0.572186  0.042026  1000.0
1    0.330646  0.540555  0.737831  0.541328  0.469906     NaN
2    0.497565  0.741719  0.242204  0.019440  0.969605     NaN
3    0.969247  0.481050  0.413165  0.272260  0.950864     NaN
4    0.240078  0.062816  0.720590  0.204707  0.835847     NaN
..        ...       ...       ...       ...       ...     ...
329  0.715793  0.668157  0.294528  0.190635  0.269703     NaN
330  0.586532  0.623190  0.696945  0.698055  0.050568     NaN
331  0.618469  0.147627  0.162156  0.932932  0.700429     NaN
332  0.814782  0.808982  0.443473  0.086186  0.062628     NaN
333  0.535169  0.700206  0.464598  0.104338  0.457526     NaN

[334 rows x 6 columns]

In [46]:
# drop the 0 column

newdf.drop(0, axis=1)

            A         B         C         D         E
0        1000  0.963852  0.537418  0.572186  0.042026
1    0.330646  0.540555  0.737831  0.541328  0.469906
2    0.497565  0.741719  0.242204  0.019440  0.969605
3    0.969247  0.481050  0.413165  0.272260  0.950864
4    0.240078  0.062816  0.720590  0.204707  0.835847
..        ...       ...       ...       ...       ...
329  0.715793  0.668157  0.294528  0.190635  0.269703
330  0.586532  0.623190  0.696945  0.698055  0.050568
331  0.618469  0.147627  0.162156  0.932932  0.700429
332  0.814782  0.808982  0.443473  0.086186  0.062628
333  0.535169  0.700206  0.464598  0.104338  0.457526

[334 rows x 5 columns]

In [48]:
newdf.loc[[1,2],['C','D']]  # first: [] row, second: [] column

          C         D
1  0.737831  0.541328
2  0.242204  0.019440

In [49]:
newdf.loc[[1,2], :]   # 1,2 row and all column

          A         B         C         D         E   0
1  0.330646  0.540555  0.737831  0.541328  0.469906 NaN
2  0.497565  0.741719  0.242204  0.019440  0.969605 NaN

In [54]:
newdf.loc[(newdf['A']<0.01)]   # A column's element < 0.01

            A         B         C         D         E   0
110  0.003307  0.721463  0.504813  0.505356  0.163121 NaN
141  0.001323  0.801954  0.571312  0.086236  0.516686 NaN
208  0.004102  0.996150  0.100212  0.546630  0.640417 NaN

In [55]:
newdf.loc[(newdf['A']<0.01) & (newdf['C']>0.5)]

            A         B         C         D         E   0
110  0.003307  0.721463  0.504813  0.505356  0.163121 NaN
141  0.001323  0.801954  0.571312  0.086236  0.516686 NaN

In [57]:
newdf.head(2)

          A         B         C         D         E       0
0      1000  0.963852  0.537418  0.572186  0.042026  1000.0
1  0.330646  0.540555  0.737831  0.541328  0.469906     NaN

In [59]:
newdf.iloc[0,4]   # iloc works with index number and loc works with exact name of index

0.04202600127859735

In [60]:
newdf.iloc[[0,3],[0,1]]

          A         B
0      1000  0.963852
3  0.969247  0.481050

In [62]:
newdf = newdf.drop(0, axis=1)

In [63]:
newdf.head(5)

          A         B         C         D         E
0      1000  0.963852  0.537418  0.572186  0.042026
1  0.330646  0.540555  0.737831  0.541328  0.469906
2  0.497565  0.741719  0.242204  0.019440  0.969605
3  0.969247  0.481050  0.413165  0.272260  0.950864
4  0.240078  0.062816  0.720590  0.204707  0.835847

In [64]:
newdf.reset_index()  # reset index

     index         A         B         C         D         E
0        0      1000  0.963852  0.537418  0.572186  0.042026
1        1  0.330646  0.540555  0.737831  0.541328  0.469906
2        2  0.497565  0.741719  0.242204  0.019440  0.969605
3        3  0.969247  0.481050  0.413165  0.272260  0.950864
4        4  0.240078  0.062816  0.720590  0.204707  0.835847
..     ...       ...       ...       ...       ...       ...
329    329  0.715793  0.668157  0.294528  0.190635  0.269703
330    330  0.586532  0.623190  0.696945  0.698055  0.050568
331    331  0.618469  0.147627  0.162156  0.932932  0.700429
332    332  0.814782  0.808982  0.443473  0.086186  0.062628
333    333  0.535169  0.700206  0.464598  0.104338  0.457526

[334 rows x 6 columns]

In [65]:
newdf.reset_index(drop=True, inplace = True) # without index column, index column drop and inplace= original data change

In [66]:
newdf

            A         B         C         D         E
0        1000  0.963852  0.537418  0.572186  0.042026
1    0.330646  0.540555  0.737831  0.541328  0.469906
2    0.497565  0.741719  0.242204  0.019440  0.969605
3    0.969247  0.481050  0.413165  0.272260  0.950864
4    0.240078  0.062816  0.720590  0.204707  0.835847
..        ...       ...       ...       ...       ...
329  0.715793  0.668157  0.294528  0.190635  0.269703
330  0.586532  0.623190  0.696945  0.698055  0.050568
331  0.618469  0.147627  0.162156  0.932932  0.700429
332  0.814782  0.808982  0.443473  0.086186  0.062628
333  0.535169  0.700206  0.464598  0.104338  0.457526

[334 rows x 5 columns]

In [68]:
newdf['B'].isnull()  # check null

0      False
1      False
2      False
3      False
4      False
       ...
329    False
330    False
331    False
332    False
333    False
Name: B, Length: 334, dtype: bool

In [69]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [70]:
df.head()

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [72]:
df.dropna()  # will drop where exists na

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [73]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [75]:
df.drop_duplicates(subset=['born'])   # remove duplicates

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [77]:
df.drop_duplicates(subset=['born'], keep='last')  # keep the last and drop the first

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [78]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

In [80]:
df['born'].value_counts()  # count value

born
1940-04-25    1
Name: count, dtype: int64

In [83]:
df['born'].value_counts(dropna=False)  # count value with NaN

born
NaT           2
1940-04-25    1
Name: count, dtype: int64

In [84]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

In [86]:
# statistic
df = pd.DataFrame({"marks1": [34, 69, 99],
                   "marks2": [47, 46, 89]})

In [87]:
df

   marks1  marks2
0      34      47
1      69      46
2      99      89

In [88]:
df.describe()

          marks1     marks2
count   3.000000   3.000000
mean   67.333333  60.666667
std    32.532035  24.542480
min    34.000000  46.000000
25%    51.500000  46.500000
50%    69.000000  47.000000
75%    84.000000  68.000000
max    99.000000  89.000000

In [89]:
df.mean()

marks1    67.333333
marks2    60.666667
dtype: float64

In [91]:
df.corr()  # correlation

          marks1    marks2
marks1  1.000000  0.831855
marks2  0.831855  1.000000

In [92]:
df.count()

marks1    3
marks2    3
dtype: int64

In [93]:
df.max()

marks1    99
marks2    89
dtype: int64

In [94]:
df.min()

marks1    34
marks2    46
dtype: int64

In [95]:
df.median()

marks1    69.0
marks2    47.0
dtype: float64

In [96]:
df.std()

marks1    32.532035
marks2    24.542480
dtype: float64